; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   green_block_1 white_block_1 purple_block_1 blue_block_1 red_block_1 purple_block_2 purple_block_3 - block
 )
 (:init (ontable green_block_1) (ontable white_block_1) (on purple_block_1 green_block_1) (on blue_block_1 white_block_1) (ontable red_block_1) (on purple_block_2 purple_block_1) (on purple_block_3 red_block_1) (clear blue_block_1) (clear purple_block_2) (clear purple_block_3) (handempty) (= (total-cost) 0))
 (:goal (and (on red_block_1 purple_block_3)))
 (:constraints (sometime (holding blue_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack blue_block_1 white_block_1)
   deleted: (on blue_block_1 white_block_1) (clear blue_block_1) (handempty)
   added: (holding blue_block_1) (clear white_block_1)
   goals met: 0 of 1
2. (putdown blue_block_1)
   deleted: (holding blue_block_1)
   added: (clear blue_block_1) (handempty) (ontable blue_block_1)
   goals met: 0 of 1
3. (unstack purple_block_3 red_block_1)
   deleted: (on purple_block_3 red_block_1) (clear purple_block_3) (handempty)
   added: (holding purple_block_3) (clear red_block_1)
   goals met: 0 of 1
4. (putdown purple_block_3)
   deleted: (holding purple_block_3)
   added: (clear purple_block_3) (handempty) (ontable purple_block_3)
   goals met: 0 of 1
5. (pickup red_block_1)
   deleted: (clear red_block_1) (ontable red_block_1) (handempty)
   added: (holding red_block_1)
   goals met: 0 of 1
6. (stack red_block_1 purple_block_3)
   deleted: (clear purple_block_3) (holding red_block_1)
   added: (handempty) (clear red_block_1) (on red_block_1 purple_block_3)
   goals met: 1 of 1
